src/Enums/ВидОперацииДокумента/ВидОперацииДокумента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидОперацииДокумента</name>
  <enumValues>
    <name>Расход</name>
  </enumValues>
  <enumValues>
    <name>Приход</name>
  </enumValues>
</mdclass:Enum>

src/CommonForms/ОбщаяФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ВидОперации") Тогда
		ВидОперации = Параметры.ВидОперации;
	КонецЕсли;
	
	Валюта = ОбщийМодульСервер_СистемныеНастройки.ПолучитьВалютуРегламентированногоУчета();
	ДатаДокумента = ТекущаяДата();
	
	Если ВидОперации = Перечисления.ВидОперацииДокумента.Приход Тогда
		СформироватьФормуПрихода();
		ЭтотОбъект.Заголовок = "Приход";
	ИначеЕсли ВидОперации = Перечисления.ВидОперацииДокумента.Расход Тогда
		СформироватьФормуРасхода();
		ЭтотОбъект.Заголовок = "Расход";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьФормуПрихода()
	
	МассивРеквизитов = Новый Массив;
	МассивРеквизитов.Добавить("ДатаДокумента");
	МассивРеквизитов.Добавить("Счет");
	МассивРеквизитов.Добавить("КатегорияДоходов");
	МассивРеквизитов.Добавить("Валюта");
	МассивРеквизитов.Добавить("Сумма");
	ОбщийМодульСервер.ДобавитьРеквизитНаФорму(ЭтотОбъект, МассивРеквизитов);
	ОбщийМодульСервер.УстановитьДействиеРеквизитуНаФорме(ЭтотОбъект, "ДатаДокумента", "НачалоВыбора", "ДатаНачалоВыбора");
	//ОбщийМодульСервер.УстановитьДействиеРеквизитуНаФорме(ЭтотОбъект, "Сумма", "НачалоВыбора", "СуммаНачалоВыбора");
	
	ОбщийМодульСервер.ДобавитьКомандуНаФорму(ЭтотОбъект, "Записать", "ЗаписатьДокумент", "Записать документ"); 
		
КонецПроцедуры

&НаСервере
Процедура СформироватьФормуРасхода()
	
	МассивРеквизитов = Новый Массив;
	МассивРеквизитов.Добавить("ДатаДокумента");
	МассивРеквизитов.Добавить("Счет");
	МассивРеквизитов.Добавить("КатегорияРасходов");
	МассивРеквизитов.Добавить("Валюта");
	МассивРеквизитов.Добавить("Сумма");
	ОбщийМодульСервер.ДобавитьРеквизитНаФорму(ЭтотОбъект, МассивРеквизитов);
	ОбщийМодульСервер.УстановитьДействиеРеквизитуНаФорме(ЭтотОбъект, "ДатаДокумента", "НачалоВыбора", "ДатаНачалоВыбора");
	
	ОбщийМодульСервер.ДобавитьКомандуНаФорму(ЭтотОбъект, "Записать", "ЗаписатьДокумент", "Записать документ");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВыборДаты" Тогда
		Если ТипЗнч(Параметр) = Тип("Структура") Тогда
			Если ЗначениеЗаполнено(Параметр.Время) Тогда
				Часов 		= Час(Параметр.Время);
				Минут 		= Минута(Параметр.Время);
				Секунд 		= Секунда(Параметр.Время);
				ВсегоСекунд = Часов*3600 + Минут*60 + Секунд;
			Иначе
				ВсегоСекунд = 0;
			КонецЕсли;
			
			ДатаДокумента = Параметр.Период + ВсегоСекунд;
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "ВводЦифр" Тогда
		
	КонецЕсли;
	
КонецПроцедуры

#Область Процедуры_действия_реквизитов

 &НаКлиенте
Процедура ДатаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)	
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("ОбщаяФорма.ФормаКалендаря", , ЭтотОбъект,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура СуммаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)	
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("ОбщаяФорма.ФормаЦифры", , ЭтотОбъект,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	
	МассивДанных = Новый Массив;
	МассивДанных.Добавить(ДатаДокумента);
	МассивДанных.Добавить(ВидОперации);
	Если ЗначениеЗаполнено(КатегорияДоходов) Тогда
	    МассивДанных.Добавить(КатегорияДоходов);
	Иначе
		МассивДанных.Добавить(КатегорияРасходов);
	КонецЕсли;
	МассивДанных.Добавить(Счет);
	МассивДанных.Добавить(Валюта);
	МассивДанных.Добавить(Сумма);
	
	ОбщийМодульКлиент.ВыполнитьДвиженияВФоне(МассивДанных);
	
	Закрыть();
	
КонецПроцедуры



#КонецОбласти
